# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

a = int(input("Ведите любое трехзначное число:  "))
b = (a-a%100)/100
c = (a%100-a%10)/10
d = a%10
print("b = ", b)
print("c = ", c)
print("d = ", d)
print("Cумма цифр введенного числа = ", b+c+d)